//Написать программу вычисления значения функции y=f(a)
double F(double a)
{
    return Math.Sin(a);
}
double sin = F(3.14);
Console.WriteLine(sin);


